test_results/ab_c1_n1000_run5.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      1
Time taken for tests:   12.176 seconds
Complete requests:      1000
Failed requests:        469
   (Connect: 0, Receive: 0, Length: 469, Exceptions: 0)
Total transferred:      361531 bytes
HTML transferred:       215531 bytes
Requests per second:    82.13 [#/sec] (mean)
Time per request:       12.176 [ms] (mean)
Time per request:       12.176 [ms] (mean, across all concurrent requests)
Transfer rate:          29.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     9   11   1.8     11      24
Waiting:        8    9   1.6      9      18
Total:         10   12   1.9     11      25

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     13
  80%     13
  90%     14
  95%     15
  98%     17
  99%     19
 100%     25 (longest request)