test_results/ab_c1_n100_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      1
Time taken for tests:   1.248 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      36200 bytes
HTML transferred:       21600 bytes
Requests per second:    80.11 [#/sec] (mean)
Time per request:       12.483 [ms] (mean)
Time per request:       12.483 [ms] (mean, across all concurrent requests)
Transfer rate:          28.32 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     9   12   2.6     11      25
Waiting:        8   10   2.2      9      23
Total:         10   12   2.7     11      26

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     13
  80%     14
  90%     15
  95%     16
  98%     23
  99%     26
 100%     26 (longest request)