test_results/ab_c1_n100_run3.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      1
Time taken for tests:   1.170 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      36200 bytes
HTML transferred:       21600 bytes
Requests per second:    85.45 [#/sec] (mean)
Time per request:       11.703 [ms] (mean)
Time per request:       11.703 [ms] (mean, across all concurrent requests)
Transfer rate:          30.21 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    10   11   1.8     10      21
Waiting:        8    9   1.6      9      19
Total:         10   11   1.8     11      21

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     11
  75%     12
  80%     12
  90%     13
  95%     15
  98%     21
  99%     21
 100%     21 (longest request)